#!/usr/bin/env python
# -*- coding=utf-8 -*-


from framework.helper import add_game_config, add_room_map, Global



add_game_config(2, 'channel.path.config', {
    '0':'全部',
	'1000':'全渠道',
	'1001_0':'官方',
    '1001_1':'推广1',
    '1001_2':'推广2',
	'1001_3':'推广3',
	'1001_4':'推广4',
	'1001_5':'推广5',
	'1003_0':'应用宝',
	'1003_1':'应用宝转包',
    '1004_0':'OPPO',
    '1004_1':'OPPO转包',
    '1005_0':'HUAWEI',
    '1005_1':'HUAWEI转包',
    '1006_0':'微商',
	'1007_0':'VIVO',
	'1007_1':'VIVO转包',
    '1007_2':'VIVO广告包',
	'1008_0':'360',
	'1008_1':'360转包',
    '1000_0':'内网0',
    '1000_1':'内网1',
    '1000_2':'内网2',
    '1000_3':'内网3',
	
	'2000_1':'cpl',
})


# add_game_config(2, 'channel.path.config', {
#	'0':'全部',
#	'1000':'全渠道',
#   '1002_0':'中讯官方',
#   '1002_1':'中讯推1',
#   '1002_2':'中讯推2',
#   '1002_3':'中讯推3',
#   '1002_4':'中讯推4',
#   '1002_5':'中讯推5',
#   '1002_6':'中讯推6',		
#   '1002_10':'中讯推10',
# })